<a href="https://colab.research.google.com/github/LeMeASh/Python/blob/main/PythonPandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
series= pd.Series([20,30,40,50,10])

In [ ]:
series

0    20
1    30
2    40
3    50
4    10
dtype: int64

In [ ]:
type(series)

pandas.core.series.Series

In [ ]:
series.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
series.values

array([20, 30, 40, 50, 10], dtype=int64)

In [ ]:
type(series.values)

numpy.ndarray

In [ ]:
scores = pd.Series([100, 200, 300, 400, 500],
                  index=['s1', 's2', 's3', 's4', 's5'])

In [ ]:
scores

s1    100
s2    200
s3    300
s4    400
s5    500
dtype: int64

In [ ]:
scores["s2"]

200

In [ ]:
scores["s3"]

300

In [ ]:
scores<250

s1     True
s2     True
s3    False
s4    False
s5    False
dtype: bool

In [ ]:
scores[scores>250]

s3    300
s4    400
s5    500
dtype: int64

In [ ]:
np.sin(scores)

s1   -0.506366
s2   -0.873297
s3   -0.999756
s4   -0.850919
s5   -0.467772
dtype: float64

In [ ]:
scores["s6"]=43

In [ ]:
scores

s1    100
s2    200
s3    300
s4    400
s5    500
s6     43
dtype: int64

In [ ]:
##Dictionary to series

inventory = {'laptop': 1500, 'bag': 50, 'TV': 300, 'speakers': 400}
inventory

{'laptop': 1500, 'bag': 50, 'TV': 300, 'speakers': 400}

In [ ]:
inventory_ser=pd.Series(inventory)

In [ ]:
inventory_ser

laptop      1500
bag           50
TV           300
speakers     400
dtype: int64

In [ ]:
inventory_ser.index

Index(['laptop', 'bag', 'TV', 'speakers'], dtype='object')

In [ ]:
inventory_ser.values

array([1500,   50,  300,  400], dtype=int64)

# Creating dataframes Using dictionary

In [ ]:
scores_data={
    "student":["a","b","c","d","e"],
    "sub1": np.random.randint(40,100,size=5),
    "sub2": np.random.randint(40,100,size=5),
    "sub3": np.random.randint(40,100,size=5)
}

In [ ]:
scores_data

{'student': ['a', 'b', 'c', 'd', 'e'],
 'sub1': array([42, 55, 50, 46, 59]),
 'sub2': array([84, 68, 81, 72, 41]),
 'sub3': array([78, 84, 51, 65, 75])}

In [ ]:
df= pd.DataFrame(scores_data)

In [ ]:
df

  student  sub1  sub2  sub3
0       a    42    84    78
1       b    55    68    84
2       c    50    81    51
3       d    46    72    65
4       e    59    41    75

In [ ]:
df.values

array([['a', 42, 84, 78],
       ['b', 55, 68, 84],
       ['c', 50, 81, 51],
       ['d', 46, 72, 65],
       ['e', 59, 41, 75]], dtype=object)

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.columns

Index(['student', 'sub1', 'sub2', 'sub3'], dtype='object')

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
type(df["student"])

pandas.core.series.Series

## creating a dataframe using a 2D array

In [ ]:
arr_2d = np.random.randint(50, 100, size=(40)).reshape(8, 5)
arr_2d

array([[79, 67, 79, 95, 67],
       [62, 63, 51, 82, 81],
       [77, 74, 71, 73, 85],
       [56, 52, 66, 60, 90],
       [81, 78, 64, 56, 58],
       [91, 82, 58, 81, 98],
       [75, 70, 93, 89, 59],
       [89, 97, 57, 50, 91]])

In [ ]:
arr_df = pd.DataFrame(arr_2d)

arr_df

    0   1   2   3   4
0  79  67  79  95  67
1  62  63  51  82  81
2  77  74  71  73  85
3  56  52  66  60  90
4  81  78  64  56  58
5  91  82  58  81  98
6  75  70  93  89  59
7  89  97  57  50  91

In [ ]:
arr_df = pd.DataFrame(arr_2d, columns=['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score'])
arr_df

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          79          67          79          95          67
1          62          63          51          82          81
2          77          74          71          73          85
3          56          52          66          60          90
4          81          78          64          56          58
5          91          82          58          81          98
6          75          70          93          89          59
7          89          97          57          50          91

In [ ]:
arr_df.columns

Index(['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score'], dtype='object')

In [ ]:
list(arr_df.columns)

['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score']

In [ ]:
arr_df.head(10)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          79          67          79          95          67
1          62          63          51          82          81
2          77          74          71          73          85
3          56          52          66          60          90
4          81          78          64          56          58
5          91          82          58          81          98
6          75          70          93          89          59
7          89          97          57          50          91

In [ ]:
arr_df.head(1)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          79          67          79          95          67

In [ ]:
arr_df.tail(1)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
7          89          97          57          50          91

In [ ]:
arr_df.sample(3)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
3          56          52          66          60          90
1          62          63          51          82          81
2          77          74          71          73          85

In [ ]:
arr_df['sub3_score'] = np.nan
arr_df

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          79          67         NaN          95          67
1          62          63         NaN          82          81
2          77          74         NaN          73          85
3          56          52         NaN          60          90
4          81          78         NaN          56          58
5          91          82         NaN          81          98
6          75          70         NaN          89          59
7          89          97         NaN          50          91

In [ ]:
##creating a dataframe using dictionary
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Rahul"],
               "Age": np.random.randint(20, 25, size=5),
               "Sub1_Score": np.random.randint(40, 100, size=5),
               "Sub2_Score": np.random.randint(40, 100, size=5),
               "Sub3_Score": np.random.randint(40, 100, size=5)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   22          84          40          55
1   Katey   21          82          89          91
2     Mak   24          68          83          51
3    Bill   21          86          77          69
4   Rahul   23          56          88          58

In [ ]:
list(scores_df.index)

[0, 1, 2, 3, 4]

In [ ]:
##setting a custom index

scores_df.index = ['A', 'B', 'C', 'D', 'E']

scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
A     Tom   22          84          40          55
B   Katey   21          82          89          91
C     Mak   24          68          83          51
D    Bill   21          86          77          69
E   Rahul   23          56          88          58

# Add new values to specific indices

In [ ]:
scores_df['sub4_score'] = np.nan
scores_df


## some of the scores for sub4 has come in

scores_df['sub4_score'] = pd.Series([98, 78, 65], index=['B', 'D', 'E'])
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
A     Tom   22          84          40          55         NaN
B   Katey   21          82          89          91        98.0
C     Mak   24          68          83          51         NaN
D    Bill   21          86          77          69        78.0
E   Rahul   23          56          88          58        65.0

In [ ]:
index = pd.Index(np.arange(5))
index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [ ]:
type(index)

pandas.core.indexes.numeric.Int64Index

In [ ]:
scores_df.index = index
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
0     Tom   22          84          40          55         NaN
1   Katey   21          82          89          91        98.0
2     Mak   24          68          83          51         NaN
3    Bill   21          86          77          69        78.0
4   Rahul   23          56          88          58        65.0

# setting and resetting index

In [ ]:
scores_df = scores_df.set_index('Student')
scores_df

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Tom       22          84          40          55         NaN
Katey     21          82          89          91        98.0
Mak       24          68          83          51         NaN
Bill      21          86          77          69        78.0
Rahul     23          56          88          58        65.0

In [ ]:


scores_df = scores_df.reset_index(drop=False)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
0     Tom   22          84          40          55         NaN
1   Katey   21          82          89          91        98.0
2     Mak   24          68          83          51         NaN
3    Bill   21          86          77          69        78.0
4   Rahul   23          56          88          58        65.0

In [ ]:
scores_df[2]

KeyError: 2

In [ ]:
scores_df[2:3]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
2     Mak   24          68          83          51         NaN

In [ ]:
scores_df[2:5]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
2     Mak   24          68          83          51         NaN
3    Bill   21          86          77          69        78.0
4   Rahul   23          56          88          58        65.0

## Column Selection

In [ ]:
scores_df[["Sub1_Score",'Sub2_Score']]

   Sub1_Score  Sub2_Score
0          84          40
1          82          89
2          68          83
3          86          77
4          56          88

# .loc() method

In [ ]:
scores_df.loc[0]

Student       Tom
Age            22
Sub1_Score     84
Sub2_Score     40
Sub3_Score     55
sub4_score    NaN
Name: 0, dtype: object

In [ ]:
scores_df.loc[0:2]

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
0     Tom   22          84          40          55         NaN
1   Katey   21          82          89          91        98.0
2     Mak   24          68          83          51         NaN

In [ ]:
scores_df = scores_df.set_index('Student')
scores_df

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Tom       22          84          40          55         NaN
Katey     21          82          89          91        98.0
Mak       24          68          83          51         NaN
Bill      21          86          77          69        78.0
Rahul     23          56          88          58        65.0

In [ ]:
scores_df.loc["Katey"]

Age           21.0
Sub1_Score    82.0
Sub2_Score    89.0
Sub3_Score    91.0
sub4_score    98.0
Name: Katey, dtype: float64

# iloc() method
difference between iloc and loc is that iloc is integer based location. In loc, we use labels to locate

In [ ]:
scores_df[::-1]

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Rahul     23          56          88          58        65.0
Bill      21          86          77          69        78.0
Mak       24          68          83          51         NaN
Katey     21          82          89          91        98.0
Tom       22          84          40          55         NaN

In [ ]:
scores_df = scores_df.reset_index(drop=False)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
0     Tom   22          84          40          55         NaN
1   Katey   21          82          89          91        98.0
2     Mak   24          68          83          51         NaN
3    Bill   21          86          77          69        78.0
4   Rahul   23          56          88          58        65.0

In [ ]:
scores_df.iloc[2]

Student       Mak
Age            24
Sub1_Score     68
Sub2_Score     83
Sub3_Score     51
sub4_score    NaN
Name: 2, dtype: object

In [ ]:
scores_df = scores_df.set_index('Student')
scores_df

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Tom       22          84          40          55         NaN
Katey     21          82          89          91        98.0
Mak       24          68          83          51         NaN
Bill      21          86          77          69        78.0
Rahul     23          56          88          58        65.0

In [ ]:
scores_df.iloc[2]

Age           24.0
Sub1_Score    68.0
Sub2_Score    83.0
Sub3_Score    51.0
sub4_score     NaN
Name: Mak, dtype: float64

In [ ]:
scores_df[2:]

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Mak       24          68          83          51         NaN
Bill      21          86          77          69        78.0
Rahul     23          56          88          58        65.0

In [ ]:
scores_df[:,2:]

TypeError: '(slice(None, None, None), slice(2, None, None))' is an invalid key

In [ ]:
scores_df.loc[:,2:]

TypeError: cannot do slice indexing on Index with these indexers [2] of type int

In [ ]:
scores_df.iloc[:,2:]

         Sub2_Score  Sub3_Score  sub4_score
Student
Tom              40          55         NaN
Katey            89          91        98.0
Mak              83          51         NaN
Bill             77          69        78.0
Rahul            88          58        65.0

In [ ]:
scores_df['Sub2_Score'] > 50

Student
Tom      False
Katey     True
Mak       True
Bill      True
Rahul     True
Name: Sub2_Score, dtype: bool

In [ ]:
scores_df[scores_df['Sub2_Score'] > 50]

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Katey     21          82          89          91        98.0
Mak       24          68          83          51         NaN
Bill      21          86          77          69        78.0
Rahul     23          56          88          58        65.0

In [ ]:
type(scores_df["Age"])

pandas.core.series.Series

In [ ]:
#cascaded Conditions

scores_df[(scores_df['Sub2_Score'] > 80) & (scores_df['Sub3_Score'] > 80)]

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Katey     21          82          89          91        98.0

# query() method for filtering

In [ ]:
scores_df.query('Sub1_Score >= 80 & Sub2_Score >= 80')

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Katey     21          82          89          91        98.0

In [ ]:
scores_df.query('Sub1_Score == Sub2_Score | Sub3_Score<60')

         Age  Sub1_Score  Sub2_Score  Sub3_Score  sub4_score
Student
Tom       22          84          40          55         NaN
Mak       24          68          83          51         NaN
Rahul     23          56          88          58        65.0

# Insert new data in dataframe

In [ ]:
##creating a dataframe using dictionary
scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Tom", "Rahul"],
               "Age": np.random.randint(20, 25, size=6),
               "Sub1_Score": np.random.randint(40, 100, size=6),
               "Sub2_Score": np.random.randint(40, 100, size=6),
               "Sub3_Score": np.random.randint(40, 100, size=6)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
3    Bill   22          61          53          40
4     Tom   22          72          70          58
5   Rahul   20          50          83          92

In [ ]:
#Using dictionary
new_student = {
    "Student": "Sahil",
    "Age": 26,
    "Sub1_Score": 92,
    "Sub2_Score": 82,
    "Sub3_Score": 67,
}

scores_df = scores_df.append(new_student, ignore_index=True)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
3    Bill   22          61          53          40
4     Tom   22          72          70          58
5   Rahul   20          50          83          92
6   Sahil   26          92          82          67

In [ ]:
#using series

new_student2 = pd.Series(data=['Luke', 22, 78, 65, 90], index=scores_df.columns)

scores_df = scores_df.append(new_student2, ignore_index=True)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
3    Bill   22          61          53          40
4     Tom   22          72          70          58
5   Rahul   20          50          83          92
6   Sahil   26          92          82          67
7    Luke   22          78          65          90

# Delete index

In [ ]:
scores_df = scores_df.drop(7)

In [ ]:
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
3    Bill   22          61          53          40
4     Tom   22          72          70          58
5   Rahul   20          50          83          92
6   Sahil   26          92          82          67

In [ ]:
scores_df = scores_df.drop(4)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
5   Rahul   20          50          83          92
6   Sahil   26          92          82          67

In [ ]:


new_student2 = pd.Series(data=['Luke', 22, 78, 65, 90], index=scores_df.columns)

scores_df = scores_df.append(new_student2, ignore_index=True)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   23          75          85          85
1   Katey   23          51          59          84
2     Mak   22          96          95          40
3   Rahul   20          50          83          92
4   Sahil   26          92          82          67
5    Luke   22          78          65          90

# Drop a Column

In [ ]:
scores_df = scores_df.drop('Sub3_Score', axis=1)
scores_df

  Student  Age  Sub1_Score  Sub2_Score
0     Tom   23          75          85
1   Katey   23          51          59
2     Mak   22          96          95
3   Rahul   20          50          83
4   Sahil   26          92          82
5    Luke   22          78          65

In [ ]:
del scores_df['Sub2_Score']

In [ ]:
scores_df

  Student  Age  Sub1_Score
0     Tom   23          75
1   Katey   23          51
2     Mak   22          96
3   Rahul   20          50
4   Sahil   26          92
5    Luke   22          78

# Merge Two dataframes

In [ ]:


scores_data = {"Student": ["Tom", "Katey", "Mak", "Bill", "Tom", "Rahul"],
               "Age": np.random.randint(20, 25, size=6),
               "Sub1_Score": np.random.randint(40, 100, size=6),
               "Sub2_Score": np.random.randint(40, 100, size=6),
               "Sub3_Score": np.random.randint(40, 100, size=6)
              }

scores_df = pd.DataFrame(scores_data)
scores_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   20          87          97          92
1   Katey   23          67          52          59
2     Mak   22          62          65          51
3    Bill   21          47          80          66
4     Tom   21          90          91          98
5   Rahul   23          92          58          78

In [ ]:
new_entries = {"Student": ["Mak", "Billy"],
               "Age": np.random.randint(20, 25, size=2),
               "Sub1_Score": np.random.randint(40, 100, size=2),
               "Sub2_Score": np.random.randint(40, 100, size=2),
               "Sub3_Score": np.random.randint(40, 100, size=2)
              }

new_df = pd.DataFrame(new_entries)
new_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Mak   23          68          92          73
1   Billy   23          66          44          93

In [ ]:
concat_df = pd.concat([scores_df, new_df], ignore_index=True)
concat_df

  Student  Age  Sub1_Score  Sub2_Score  Sub3_Score
0     Tom   20          87          97          92
1   Katey   23          67          52          59
2     Mak   22          62          65          51
3    Bill   21          47          80          66
4     Tom   21          90          91          98
5   Rahul   23          92          58          78
6     Mak   23          68          92          73
7   Billy   23          66          44          93